package com.jteam.GroupProject.BotConstants;

public class Information {
    public static final String HOW_TO_ADOPT_AN_ANIMAL = """
            Для того, чтобы забрать питомца из приюта, необходимо оформить договор.
            Обязательное условие — наличие копии паспорта.
            Если у человека нет личного транспорта или иной возможности забрать животное самостоятельно,
            волонтёры могут сами привезти питомца домой. Сотрудники приюта следят за судьбами подопечных и просят
            отправлять им фото-приветы от хвостиков. Иногда могут заехать в гости, чтобы убедиться, что собака или
            кошка живут счастливо в новой семье.
            """;

    public static final String WELCOME = """
                        Рады приветствовать Вас в нашем боте!
                        У нас здесь живут друзья разных пород и размеров - от веселых щенков до ласковых котиков.
                        Мы надеемся, что ты найдешь своего идеального друга здесь
                        Выберите приют:
                        """;
    public static final String ANIMAL_DATING_RULES = """
            1. Никогда не подходите к животному сзади или сверху, это может их напугать и вызвать агрессивную реакцию.
            2. Поговорите с сотрудниками приюта, чтобы узнать, какое поведение у этого животного, и как наилучшим образом общаться с ним.
            3. Если вы уже имеете домашних животных, принесите их с собой для знакомства с новым приемлемым другом.
            4. Не протягивайте руки и не приближайтесь, если животное выглядит напуганным или злым.
            5. Не оставляйте детей без присмотра рядом с животными, особенно если они незнакомы друг с другом.
            6. Помните, что животное может быть стрессованным из-за изменения условий, и знакомство может потребовать времени и терпения.
            """;

    public static final String LIST_OF_DOCUMENTS = """
            1. Паспорт или удостоверение личности.
            2. Справка из жилого помещения: подтверждение, что вы можете принять животное в качестве питомца в своей квартире или доме.
            3. Договор о передаче животного: зафиксированный договор, который устанавливает условия передачи животного из приюта в ваше владение.
            4. Справка о доходах: документ, подтверждающий вашу финансовую состоятельность и возможность обеспечить животное необходимыми средствами.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_KITTEN_PUPPY = """
            1. Создайте безопасное место для животного: выделите часть дома для животного, где он может чувствовать себя в безопасности, включая место для сна, игры и еды.
            2. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            3. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            4. Подготовьте место для туалета: подготовьте место для туалета, чтобы ваше животное знало, где ему нужно справлять нужду.
            5. Подготовьте игрушки: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            6. Подготовьте корм и воду: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            7. Установите место для сна: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            8. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_ADULT_ANIMAL = """
            1. Создайте комфортное место для вашего животного: установите место для сна, чтобы ваше животное имело спокойное место для отдыха.
            2. Убедитесь, что дом достаточно просторный и светлый: животные не любят тесноты и темноты, поэтому убедитесь, что ваш дом достаточно просторный и светлый.
            3. Закройте доступ к опасным зонам: закройте двери и окна, которые могут быть опасными для животных, например, на балкон или на улицу.
            4. Подготовьте место для туалета: если ваше животное не знает, где ему нужно справлять нужду, подготовьте ему место для туалета и научите его этому.
            5. Уберите ядовитые растения и опасные предметы: удалите все растения, которые могут быть ядовитыми для животных, а также уберите опасные предметы, которые могут быть глотнуты или повреждены.
            6. Обеспечьте животное игрушками: обеспечьте животное игрушками, чтобы оно чувствовало себя занятым и развлеченным, а также чтобы оно не грызло мебель и другие вещи.
            7. Свободный доступ к воде и корму: установите миски для корма и воды в спокойном месте, где животное может легко добраться до них.
            8. Убедитесь, что ваше животное получает достаточно физических и умственных упражнений: животные нуждаются в физических и умственных упражнениях, чтобы оставаться здоровыми и счастливыми, поэтому убедитесь, что вы занимаетесь с вашим животным, играете с ним и проводите время на улице.
            """;

    public static final String RECOMMENDATIONS_HOME_IMPROVEMENT_DISABLED_ANIMAL = """
            1. Сделайте дом более доступным: установите рампы или лифты, которые позволят животному подниматься и спускаться по лестнице, если необходимо.
            2. Уберите препятствия: уберите все препятствия и мебель, которая может помешать животному передвигаться по дому.
            3. Установите специальные средства передвижения: установите коляски или другие средства передвижения, которые могут помочь животному передвигаться по дому и на улице.
            4. Сделайте спальное место более удобным: обеспечьте комфортное место для сна, чтобы животное могло спокойно отдыхать и получать необходимый отдых.
            5. Установите специальный туалет: установите туалет, который легко доступен для животного и не создаст ему трудностей в использовании.
            6. Обеспечьте ограниченные зоны: установите барьеры, которые будут ограничивать доступ животного к опасным зонам, например, к лестницам или кухне, где могут быть опасные предметы.
            7. Обеспечьте животное игрушками и стимулами: обеспечьте животное игрушками и другими стимулами, чтобы оно чувствовало себя занятым и развлеченным.
            8. Организуйте двери и окна: убедитесь, что двери и окна легко открываются и закрываются, чтобы животное могло свободно передвигаться по дому.
            """;

    public static final String DOG_HANDLERS_ADVICE = """
            1. Не подходите к собаке слишком близко и не говорите с ней слишком громко. Оставайтесь спокойным и уверенным, но не доминируйте над собакой.
            2. Дайте собаке время, чтобы она осмотрелась и привыкла к вам. Не пытайтесь знакомиться с собакой сразу же.
            3. Если собака приближается к вам, не паникуйте и не отскакивайте от нее. Просто осторожно протяните руку для знакомства.
            4. Не приближайтесь к собаке сверху. Для нее это может быть угрожающим.
            5. Если собака начинает с вами играть, не дразните ее и не демонстрируйте агрессию. Играйте с ней активно и весело, но не допускайте, чтобы игры превратились в драку.
            6. Часто говорите с собакой и используйте ее имя. Награждайте ее ласками и похвалой за хорошее поведение.
            7. Старайтесь узнать о породе собаки и ее особенностях, чтобы понимать, как лучше с нею общаться.
            8. Никогда не угрожайте и не наказывайте собаку физически. Это может привести к агрессивному поведению и проблемам в будущем.
            9. Если вам не удается установить контакт с собакой, не настаивайте на этом. Попросите помощи у кинолога или другого опытного специалиста по тренировке собак.
            """;

    public static final String DOG_HANDLERS_CONTACTS = """
            1. Иван Петров
            2. +7 (999) 123-45-67
            3. Круглосуточно
                        
            1. Анна Сидорова
            2. +7 (499) 765-43-21
            3. Понедельник-пятница: с 9:00 до 18:00
                        
            1. Дмитрий Белов
            2. +7 (987) 654-32-10
            3. Понедельник, среда, пятница: с 10:00 до 20:00; вторник, четверг: с 14:00 до 22:00; суббота: с 11:00 до 18:00; воскресенье: выходной.
            """;

    public static final String LIST_OF_REASON_FOR_DENY = """
            1. Неудовлетворительные условия проживания. Если дом или окружающая среда не соответствуют нуждам животного, приют может отказать в передаче животного.
            2. Недостаточный доход. Если житель не в состоянии содержать животное из-за ограниченных финансовых возможностей, приют может отказать в передаче животного.
            3. Недостаточно времени. Если человек не может уделять достаточно времени на заботу о животном, приют может отказать в передаче животного.
            4. Неудовлетворительное здоровье. Если здоровье жителя не позволяет ухаживать за животным, приют может отказать в передаче животного.
            5. Некомпетентность в обращении с животными. Если человек не умеет обращаться с животными и не может предоставить достаточную заботу и заботу о животном, приют может отказать в передаче животного.
            6. Неидеальное окружение. Если приют не уверен в безопасности животного в новом окружении, приют может отказать в передаче животного.
            7. Несоответствие возраста животного. Приют может отказать в передаче животного, если животное слишком молодое, чтобы быть переданным в домашний питомник, или слишком старое, чтобы было принято на ответственное содержание.
            8. Несоответствие правилам приюта. Если житель не соответствует правилам приюта или не предоставляет достаточно информации и документов, приют может отказать в передаче животного.
            """;

    public static final String TRIAL_NOT_SUCCESSFUL = """
            "Здравствуйте, хотим сообщить вам, что вы не справились с заботой о своем новом друге, и вам нужно вернуть его в приют.
            Наши волонтёры готовы помочь вам с этим процессом и забрать животное сами."
            """;
    public static final String TRIAL_EXTENDED = """
            Ваш испытательный срок продлён. Пожалуйста свяжитесь с волонтёрами.
            """;

    public static final String SUCCESSFUL = """
            Ваш испытательный срок завершён. Пожалуйста свяжитесь с волонтёрами.
            """;
    public static final String TRANSPORTATION_OF_THE_ANIMAL = """
             1. Используйте только рекомендованные переноски для перевозки животных. Они должны иметь достаточное пространство для комфортного передвижения и хорошую вентиляцию.
             2. Убедитесь, что ваш питомец имеет все необходимые прививки и медицинские документы, прежде чем перевозить его.
             3. Дайте питомцу привыкнуть к переноске, в котором он будет перевозиться, чтобы он чувствовал себя более комфортно.
             4. Никогда не оставляйте своего питомца в переноске в течение продолжительного времени, даже если это возможно.
             5. Если вы путешествуете на большие расстояния, сделайте паузы для того, чтобы ваш питомец смог выйти из переноски, выпить воды и растянуть ноги.
             6. Проверяйте своего питомца регулярно во время поездки, чтобы убедиться в его комфорте и безопасности.
            """;
    public static final String INFO_REPORT = """
            Отправьте фотографию питомца с комментарием в следующем формате:
            Рацион: Ваш текст;
            Здоровье: Ваш текст;
            Поведение: Ваш текст;""";
}

